Revit 2026 API

# IntegerRange Properties

---

The IntegerRange type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | High | The upper limit of the range |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Low | The lower limit of the range |

#### Reference

IntegerRange Class

Autodesk.Revit.DB Namespace